;================================================================
; Файл инициализации для библиотеки энкодера
; 
; АХТУНГ!!! Файл располагать в сегменте кода, в файле инит!!!
;================================================================

	cbi		ENC_DDR,ENC_A
	cbi		ENC_DDR,ENC_B

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; инициализация переменных энкодера
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	clr		tempreg
	sts		ENCOld,tempreg
	sts		ENCCounter,tempreg
