;================================================================
; Файл инициализации софт-таймера
; 
; АХТУНГ!!! Файл располагать в сегменте кода, в файле инит!!!
;================================================================

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; Инициализируем SoftTimer
; назначаем TMR1
; тикает раз в 1 мсек
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	ldi		tempreg,high(XTAL/1000-1)				; 1000 - период работы таймера, мсек
	out		OCR1Ah,tempreg
	ldi		tempreg,low(XTAL/1000-1)				; 1000 - период работы таймера, мсек
	out		OCR1Al,tempreg
	ldi		tempreg,(0<<WGM11|0<<WGM10)
	out		TCCR1A,tempreg
	ldi		tempreg,(0<<WGM13|1<<WGM12|0<<CS12|0<<CS11|1<<CS10)
	out		TCCR1B,tempreg
	ldi		tempreg,(1<<OCIE1A)
	out		TIMSK,tempreg
