;================================================================
; ПП инициализации всего и вся
;================================================================

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
;Таблица векторов прерываний
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	.org	0x0000
	rjmp	init
	.org	OC1Aaddr						; Совпадение TMR1
	rjmp	Soft_timer
	.org	OC0Aaddr
	rjmp	DynIndik

init:
	ldi		tempreg,low(RAMEND)				;Инициализация стека
	out		SPl,tempreg							;Обязательно!!!

;----------------------------------------------------------------
; пауза для инициализации периферии
;----------------------------------------------------------------
	ser		Zh
	ser		Zl
	sbiw	Z,1
	brne	pc-1

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; Другие инклюды
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	.include	"SoftTimer\Init_SoftTimer.asm"
	.include	"DynIndik\Init_Dyn_Indik.asm"
	.include	"Buttons\Init_ButOpros.asm"
	.include	"Encoder\Init_Encoder.asm"


;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; инициализация порта нагрузки
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	LOAD_OFF
	sbi		LOAD_DDR,LOAD

