;================================================================
; ПП инициализации всего и вся
;================================================================

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
;Таблица векторов прерываний
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	.org	0x0000
	rjmp	init
	.org	OC1Aaddr						; Совпадение TMR1
	rjmp	Soft_timer
	.org	OC0Aaddr
	rjmp	DynIndik

init:
	ldi		tempreg,low(RAMEND)				;Инициализация стека
	out		SPl,tempreg							;Обязательно!!!

;----------------------------------------------------------------
; пауза для инициализации периферии
;----------------------------------------------------------------
	ser		Zh
	ser		Zl
	sbiw	Z,1
	brne	pc-1

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; Другие инклюды
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	.include	"SoftTimer\Init_SoftTimer.asm"
	.include	"DynIndik\Init_Dyn_Indik.asm"
	.include	"Buttons\Init_ButOpros.asm"
	.include	"Encoder\Init_Encoder.asm"


;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; инициализация порта нагрузки
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	LOAD_OFF
	sbi		LOAD_DDR,LOAD

;----------------------------------------------------
; Это потом стереть (нужно для отладки)

;---------------------------------------------------
; Инициализация уставок
;---------------------------------------------------

/*	ldi		tempreg,80
	sts		ustavka_0,tempreg
	
	ldi		tempreg,5
	sts		hister_0,tempreg

	ldi		tempreg,25
	sts		ustavka_1,tempreg

	ldi		tempreg,45
	sts		ustavka_1+1,tempreg
		
	ldi		tempreg,1
	sts		hister_1,tempreg

	rcall	ee_write_ust

	rjmp	pc*/





