;================================================================
; Файл инициализации для библиотеки опроса кнопки
; 
; АХТУНГ!!! Файл располагать в сегменте кода, в файле инит!!!
;================================================================

	cbi		BUT_DDR,BUTTON


;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; инициализация таймера опроса кнопки
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	ldi		tempreg,ButOpros_tmr_init
	sts		ButOpros_timer,tempreg

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; инициализация таймера долгого нажатия кнопки
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	clr		tempreg
	sts		But_LongPress+1,tempreg
	sts		But_LongPress,tempreg

	clr		buttons
